## Plan Result (883: prod_landing - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_managed_disk.managed_disks[&#34;ingest05-legacy-data-disk-01&#34;]
  * module.data_landing_zone[&#34;05&#34;].module.legacy_database[&#34;legacy-sql&#34;].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;ingest05-legacy-data-disk-01&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["05"].module.legacy_database["legacy-sql"].azurerm_managed_disk.managed_disks["ingest05-legacy-data-disk-01"] will be created
  + resource "azurerm_managed_disk" "managed_disks" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 10240
      + id                                = (known after apply)
      + location                          = "uksouth"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "ingest05-legacy-data-disk-01"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "ingest05-main-prod"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = {
          + "Data-Ingest-Project" = "Crime Legacy Migration"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "false"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "High"
          + "environment"         = "production"
          + "startupMode"         = "always"
        }
      + tier                              = (known after apply)
      + zone                              = "1"
    }

  # module.data_landing_zone["05"].module.legacy_database["legacy-sql"].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments["ingest05-legacy-data-disk-01"] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachments" {
      + caching                   = "None"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 0
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest05-main-prod/providers/Microsoft.Compute/virtualMachines/ingest05-legacy-sql-prod"
      + write_accelerator_enabled = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 883: prod_landing - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":131,"Program":"tfcmt","SHA1":"","Target":"883: prod_landing - TerraformPlanApply","Vars":{}} -->